rt/databinding/sdo/src/test/java/org/apache/cxf/sdo/structure.xml

<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/">
 <env:Header/>
 <env:Body>
  <echoStruct xmlns="http://apache.org/cxf/databinding/sdo/hello_world_soap_http/types">
  	<struct>
  		<text>Hello</text>
  		<int>24</int>
  		<dbl>3.14159</dbl>
  		<texts>Hello</texts>
  		<texts>World</texts>
  	</struct>
  </echoStruct>
 </env:Body>
</env:Envelope>